---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartType
source: html/164d0c34-3888-c0ea-1732-b7b84fc63952.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralAttachmentStartType Property

"Start Attachment Type"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAttachmentStartType { get; }
```